# <img style="float: left; padding-right: 20px; width: 200px" src="https://raw.githubusercontent.com/raxlab/imt2200-data/main/media/logo.jpg">



# IMT 2200 - Introducción a Ciencia de Datos
**Pontificia Universidad Católica de Chile**<br>
**Instituto de Ingeniería Matemática y Computacional**<br>
**Profesor:** Rodrigo A. Carrasco <br>
**Alumno:** Israel Pino Saavedra <br>
---

Esta tarea tendrá como objetivo crear un predictor que determine el éxito o fracaso de una expedición a distintas montañas del Himalayas según datos del montañista y de la expedición. Vamos a responder a la pregunta de qué tan bien pueden atributos como año, estación, montaña, edad del montañista, entre otros, predecir el éxito o fracaso de una expedición.

# <h1><center> 3.1 DataFrame unificado (0.2 pts)
 </center></h1>

Sheets : https://docs.google.com/spreadsheets/d/11-fVTpCaHDj658sHjvNLFDWc1-Nyrv5u_Se79xvUAuI/edit?gid=0#gid=0

In [17]:
pip install plotly

Requirement already satisfied: plotly in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (6.4.0)
Requirement already satisfied: narwhals>=1.15.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from plotly) (2.10.2)
Requirement already satisfied: packaging in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from plotly) (25.0)

[notice] A new release of pip is available: 24.3.1 -> 25.3
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
# ...agregeu otras librerías si lo considera relevante

In [9]:
df_peaks=pd.read_csv('Himalayan+Expeditions/peaks.csv', usecols= ['peakid', 'pkname', 'heightm'])
df_peaks_exp=pd.read_csv('Himalayan+Expeditions/peaks_with_exp.csv', usecols=['peakid', 'success_exp', 'failed_exp'] )
df_exped=pd.read_csv('Himalayan+Expeditions/exped.csv', usecols=['expid', 'peakid', 'year', 'season'])
df_members=pd.read_csv('Himalayan+Expeditions/members.csv', usecols=['membid', 'expid', 'peakid', 'sex', 'yob', 'citizen', 'msuccess'])

1. Información de las montañas:
    * ID de la cima (`peakid`)
    * Nombre común de la montaña (`pkname`)
    * Altura (m) (`heightm`)
    * Cantidad de expediciones exitosas (`success_exp`)
    * Cantidad de expediciones fallidas (`failed_exp`)

2. Información de las expediciones:
    * ID de la expedición (`expid`)
    * Año (`year`)
    * Estación del año (`season`)

3. Información de los montañistas:
    * ID del miembro (`memid`)
    * Sexo (`sex`)
    * Año de nacimiento (`yob`)
    * Nacionalidad (`citizen`)
    * Completó la expedición exitosamente (`msuccess`)

In [14]:
df_peaks.head()

  peakid         pkname  heightm
0   ACHN         Aichyn     6055
1   AMAD     Ama Dablam     6814
2   AMOT       Amotsang     6393
3   AMPG  Amphu Gyabjen     5630
4   AMPH        Amphu I     6740

In [10]:
df_peaks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   peakid   480 non-null    object
 1   pkname   480 non-null    object
 2   heightm  480 non-null    int64
dtypes: int64(1), object(2)
memory usage: 11.4+ KB

In [15]:
df_peaks_exp.head()

  peakid  failed_exp  success_exp
0   ACHN           1            2
1   AMAD         453         1123
2   AMOT           2            1
3   AMPG           1            3
4   AMPH           1            1

In [11]:
df_peaks_exp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   peakid       480 non-null    object
 1   failed_exp   480 non-null    int64
 2   success_exp  480 non-null    int64
dtypes: int64(2), object(1)
memory usage: 11.4+ KB

In [12]:
df_exped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11425 entries, 0 to 11424
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   expid   11425 non-null  object
 1   peakid  11425 non-null  object
 2   year    11425 non-null  int64
 3   season  11425 non-null  object
dtypes: int64(1), object(3)
memory usage: 357.2+ KB

In [13]:
df_members.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89000 entries, 0 to 88999
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   expid     89000 non-null  object
 1   membid    89000 non-null  int64
 2   peakid    89000 non-null  object
 3   sex       89000 non-null  object
 4   yob       83592 non-null  float64
 5   citizen   88993 non-null  object
 6   msuccess  89000 non-null  bool
dtypes: bool(1), float64(1), int64(1), object(4)
memory usage: 4.2+ MB

In [21]:
df_peaks_unif= df_peaks.merge(df_peaks_exp, how='outer', on='peakid')
df_peaks_unif.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   peakid       480 non-null    object
 1   pkname       480 non-null    object
 2   heightm      480 non-null    int64
 3   failed_exp   480 non-null    int64
 4   success_exp  480 non-null    int64
dtypes: int64(3), object(2)
memory usage: 18.9+ KB

In [24]:
df_peaks_unif.head()

  peakid         pkname  heightm  failed_exp  success_exp
0   ACHN         Aichyn     6055           1            2
1   AMAD     Ama Dablam     6814         453         1123
2   AMOT       Amotsang     6393           2            1
3   AMPG  Amphu Gyabjen     5630           1            3
4   AMPH        Amphu I     6740           1            1

In [23]:
df_exped_members= df_exped.merge(df_members, how='left', on=['expid', 'peakid'])
df_exped_members.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89104 entries, 0 to 89103
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   expid     89104 non-null  object
 1   peakid    89104 non-null  object
 2   year      89104 non-null  int64
 3   season    89104 non-null  object
 4   membid    89089 non-null  float64
 5   sex       89089 non-null  object
 6   yob       83665 non-null  float64
 7   citizen   89082 non-null  object
 8   msuccess  89089 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 6.1+ MB

In [25]:
df_exped_members.head()

       expid peakid  year  season  membid sex     yob citizen msuccess
0  ANN260101   ANN2  1960  Spring     1.0   M  1916.0      UK    False
1  ANN260101   ANN2  1960  Spring     4.0   M  1927.0      UK     True
2  ANN260101   ANN2  1960  Spring     3.0   M  1932.0      UK    False
3  ANN260101   ANN2  1960  Spring    10.0   M  1930.0      UK    False
4  ANN260101   ANN2  1960  Spring     2.0   M  1934.0      UK     True

In [26]:
df_agregado= df_exped_members.merge(df_peaks_unif, how='left', on='peakid')
df_agregado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89104 entries, 0 to 89103
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   expid        89104 non-null  object
 1   peakid       89104 non-null  object
 2   year         89104 non-null  int64
 3   season       89104 non-null  object
 4   membid       89089 non-null  float64
 5   sex          89089 non-null  object
 6   yob          83665 non-null  float64
 7   citizen      89082 non-null  object
 8   msuccess     89089 non-null  object
 9   pkname       89104 non-null  object
 10  heightm      89104 non-null  int64
 11  failed_exp   89104 non-null  int64
 12  success_exp  89104 non-null  int64
dtypes: float64(2), int64(4), object(7)
memory usage: 8.8+ MB

In [27]:
df_agregado.head()

,expid,peakid,year,season,membid,sex,yob,citizen,msuccess,pkname,heightm,failed_exp,success_exp
0,ANN260101,ANN2,1960,Spring,1.0,M,1916.0,UK,False,Annapurna II,7937,29,6
1,ANN260101,ANN2,1960,Spring,4.0,M,1927.0,UK,True,Annapurna II,7937,29,6
2,ANN260101,ANN2,1960,Spring,3.0,M,1932.0,UK,False,Annapurna II,7937,29,6
3,ANN260101,ANN2,1960,Spring,10.0,M,1930.0,UK,False,Annapurna II,7937,29,6
4,ANN260101,ANN2,1960,Spring,2.0,M,1934.0,UK,True,Annapurna II,7937,29,6